In [1]:
import numpy as np
import pandas as pd

In [2]:
df =pd.read_csv('100 Sales Records.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 14 columns):
Region            100 non-null object
Country           100 non-null object
Item Type         100 non-null object
Sales Channel     100 non-null object
Order Priority    100 non-null object
Order Date        100 non-null object
Order ID          100 non-null int64
Ship Date         100 non-null object
Units Sold        100 non-null int64
Unit Price        100 non-null float64
Unit Cost         100 non-null float64
Total Revenue     100 non-null float64
Total Cost        100 non-null float64
Total Profit      100 non-null float64
dtypes: float64(5), int64(2), object(7)
memory usage: 11.0+ KB

In [6]:
df_1 = df.Region
df_1.head(25)

0                 Australia and Oceania
1     Central America and the Caribbean
2                                Europe
3                    Sub-Saharan Africa
4                    Sub-Saharan Africa
5                 Australia and Oceania
6                    Sub-Saharan Africa
7                    Sub-Saharan Africa
8                    Sub-Saharan Africa
9                    Sub-Saharan Africa
10                                 Asia
11                   Sub-Saharan Africa
12                                 Asia
13    Central America and the Caribbean
14                                 Asia
15                               Europe
16                                 Asia
17                   Sub-Saharan Africa
18                                 Asia
19                Australia and Oceania
20                               Europe
21                               Europe
22    Central America and the Caribbean
23                Australia and Oceania
24                               Europe
Name: Region, dtype: object

In [9]:
df_1.mode()

0    Sub-Saharan Africa
dtype: object

In [12]:
df.describe()

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+02,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02
mean,5.550204e+08,5128.710000,276.761300,191.048000,1.373488e+06,9.318057e+05,4.416820e+05
std,2.606153e+08,2794.484562,235.592241,188.208181,1.460029e+06,1.083938e+06,4.385379e+05
min,1.146066e+08,124.000000,9.330000,6.920000,4.870260e+03,3.612240e+03,1.258020e+03
25%,3.389225e+08,2836.250000,81.730000,35.840000,2.687212e+05,1.688680e+05,1.214436e+05
50%,5.577086e+08,5382.500000,179.880000,107.275000,7.523144e+05,3.635664e+05,2.907680e+05
75%,7.907551e+08,7369.000000,437.200000,263.330000,2.212045e+06,1.613870e+06,6.358288e+05
max,9.940222e+08,9925.000000,668.270000,524.960000,5.997055e+06,4.509794e+06,1.719922e+06

In [14]:
df_2 = df[df.Region==0]

In [34]:
df_3 = df.loc[ : , 'Unit Cost' ]
df_3.head(25)

0     159.42
1     117.11
2     524.96
3       6.92
4     524.96
5     159.42
6     502.54
7      90.93
8      56.67
9     117.11
10     90.93
11     35.84
12     35.84
13    502.54
14     56.67
15     35.84
16    263.33
17     31.79
18    502.54
19    364.69
20    159.42
21    159.42
22     97.44
23      6.92
24     56.67
Name: Unit Cost, dtype: float64

In [35]:
df_3.mean()

191.04800000000006

In [36]:
df_3.describe()

count    100.000000
mean     191.048000
std      188.208181
min        6.920000
25%       35.840000
50%      107.275000
75%      263.330000
max      524.960000
Name: Unit Cost, dtype: float64